In [2]:
import pandas as pd

In [3]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [4]:
pd.DataFrame({'Name':[ 'Monika' ,' Prathibha' , 'Devika' ] , 'About' :[ ' Doctor life' , 'Enginerr life' , 'enginerring life' ]})

         Name             About
0      Monika       Doctor life
1   Prathibha     Enginerr life
2      Devika  enginerring life

In [5]:
pd.DataFrame({'Name':['Navya' , 'Prathibha' ,'monika'] , 'school':['MABL','LAS','NHS']}, index=['Student1','Student2','Student3'])

               Name school
Student1      Navya   MABL
Student2  Prathibha    LAS
Student3     monika    NHS

In [6]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
pd.Series([ 30,65,65], index=['2014 sales','2015 sales','2017 sales'], name='product')

2014 sales    30
2015 sales    65
2017 sales    65
Name: product, dtype: int64

In [8]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [9]:
# 1D data structure 
# Series cant handle multiple data types
# (values , index, data type)
# Convert list/tuple to create a series

In [10]:
pd.Series(['2015 sales'])

0    2015 sales
dtype: object

In [11]:
sr1= pd.Series([10,20,30,40,50])
sr1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [12]:
sr1[4]

np.int64(50)

In [13]:
sr1= pd.Series([10,20,30,40,50] , index=['a','b','c','d','e'],dtype= float)
sr1

a    10.0
b    20.0
c    30.0
d    40.0
e    50.0
dtype: float64

In [14]:
# DataFrame creation and manipulation

In [15]:
# 2D data structure (table)
# data frame is created by combining multiple columns
# each column should have its own data type (single data type)
# each column can be list/tuple/Series/1D array

In [16]:
dict1=  {
    'col1' : [1,2,3],
    'col2' :pd.Series(['a','b','c'])
}
df1=pd.DataFrame(dict1)
df1

   col1 col2
0     1    a
1     2    b
2     3    c

In [17]:
df1.dtypes

col1     int64
col2    object
dtype: object

In [18]:
df1=pd.DataFrame({'id' :[2,3,4,5,6], 'stat_marks': [53,98,88,96,69]})
df2=pd.DataFrame({'id' :[2,3,4,5,6], 'ml_marks': [93,88,78,100,99]})
pd.concat([df1, df2])

   id  stat_marks  ml_marks
0   2        53.0       NaN
1   3        98.0       NaN
2   4        88.0       NaN
3   5        96.0       NaN
4   6        69.0       NaN
0   2         NaN      93.0
1   3         NaN      88.0
2   4         NaN      78.0
3   5         NaN     100.0
4   6         NaN      99.0

In [19]:
df3 =pd.concat([df1, df2])
df3

   id  stat_marks  ml_marks
0   2        53.0       NaN
1   3        98.0       NaN
2   4        88.0       NaN
3   5        96.0       NaN
4   6        69.0       NaN
0   2         NaN      93.0
1   3         NaN      88.0
2   4         NaN      78.0
3   5         NaN     100.0
4   6         NaN      99.0

In [20]:
df3.reset_index()# by default reset_index will store old index in a new column

   index  id  stat_marks  ml_marks
0      0   2        53.0       NaN
1      1   3        98.0       NaN
2      2   4        88.0       NaN
3      3   5        96.0       NaN
4      4   6        69.0       NaN
5      0   2         NaN      93.0
6      1   3         NaN      88.0
7      2   4         NaN      78.0
8      3   5         NaN     100.0
9      4   6         NaN      99.0

In [21]:
df3.reset_index(drop = True) # drop = True --> old index wont be saved
# by default changes wont be saved in df3

   id  stat_marks  ml_marks
0   2        53.0       NaN
1   3        98.0       NaN
2   4        88.0       NaN
3   5        96.0       NaN
4   6        69.0       NaN
5   2         NaN      93.0
6   3         NaN      88.0
7   4         NaN      78.0
8   5         NaN     100.0
9   6         NaN      99.0

In [22]:
#select * from df1 join df2 on df1.id = df2.id

df1.merge(df2 , on ='id' , how='left')

In [23]:
df1.merge(df2 , on ='id' , how='left')

   id  stat_marks  ml_marks
0   2          53        93
1   3          98        88
2   4          88        78
3   5          96       100
4   6          69        99

In [24]:
df1.merge(df2 , on ='id' , how='right')

   id  stat_marks  ml_marks
0   2          53        93
1   3          98        88
2   4          88        78
3   5          96       100
4   6          69        99

In [25]:
df1.merge(df2 , on ='id' , how='outer')

   id  stat_marks  ml_marks
0   2          53        93
1   3          98        88
2   4          88        78
3   5          96       100
4   6          69        99

In [26]:
df1.merge(df2 , on ='id' , how='inner')

   id  stat_marks  ml_marks
0   2          53        93
1   3          98        88
2   4          88        78
3   5          96       100
4   6          69        99

In [27]:
df1

   id  stat_marks
0   2          53
1   3          98
2   4          88
3   5          96
4   6          69

In [28]:
df2

   id  ml_marks
0   2        93
1   3        88
2   4        78
3   5       100
4   6        99

In [29]:

pd.concat([df1, df2])

   id  stat_marks  ml_marks
0   2        53.0       NaN
1   3        98.0       NaN
2   4        88.0       NaN
3   5        96.0       NaN
4   6        69.0       NaN
0   2         NaN      93.0
1   3         NaN      88.0
2   4         NaN      78.0
3   5         NaN     100.0
4   6         NaN      99.0

In [30]:
import os
os.getcwd()

'c:\\Users\\Admin\\prathu'

In [31]:
# Note: df4 will be defined later when reading from CSV
# Using df1 here as an example instead
df1.head()

   id  stat_marks
0   2          53
1   3          98
2   4          88
3   5          96
4   6          69

In [32]:
import pandas as pd

df1 = pd.DataFrame({'id':[1,2,3,4,5], 'stats_marks': [94,85,73,96,99]})
df2 = pd.DataFrame({'id':[7,8,9,10,11], 'ml_marks':[80,86,76,94,100]})

In [33]:
df1

   id  stats_marks
0   1           94
1   2           85
2   3           73
3   4           96
4   5           99

In [34]:
pd.concat([df1,df2])

   id  stats_marks  ml_marks
0   1         94.0       NaN
1   2         85.0       NaN
2   3         73.0       NaN
3   4         96.0       NaN
4   5         99.0       NaN
0   7          NaN      80.0
1   8          NaN      86.0
2   9          NaN      76.0
3  10          NaN      94.0
4  11          NaN     100.0

In [35]:
import pandas as pd

df4 = pd.DataFrame({'id':[1,2,3,4,5], 'stats_marks': [94,85,73,96,99]})
df5 = pd.DataFrame({'id':[7,8,9,10,11], 'stats_marks':[80,86,76,94,100]})
df6 = pd.concat([df4,df5])
df6

   id  stats_marks
0   1           94
1   2           85
2   3           73
3   4           96
4   5           99
0   7           80
1   8           86
2   9           76
3  10           94
4  11          100

In [36]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stats_marks': [94,95,99,92,94]})
df2 = pd.DataFrame({'sno': [6,7,8,9,10], 'ml_marks': [93,97,94,90,88]})
df2

   sno  ml_marks
0    6        93
1    7        97
2    8        94
3    9        90
4   10        88

In [37]:
df1.join(df2)

   id  stats_marks  sno  ml_marks
0   1           94    6        93
1   2           95    7        97
2   3           99    8        94
3   4           92    9        90
4   5           94   10        88

In [38]:
import os
os.getcwd()

'c:\\Users\\Admin\\prathu'

In [39]:
df1 = pd.read_csv('Auto.csv') # r - read/raw strings
df1.head() # top 5 observations by default 
# rows/ observations/ records/ data points

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [3]:
import pandas as pd
df4 = pd.read_csv('Auto.csv')
df4

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [4]:
# pd.read_csv --> Auto.csv # function and filename extension should match
# pd.read_excel ---> .xlsx

In [5]:
df4.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino
5,NaN,8.0,NaN,198,4341,10.0,70,1,ford galaxie 500
6,NaN,8.0,NaN,220,4354,9.0,70,1,chevrolet impala
7,14.0,8.0,NaN,215,4312,8.5,70,1,plymouth fury iii
8,14.0,8.0,455.0,225,4425,10.0,70,1,pontiac catalina
9,15.0,8.0,390.0,190,3850,8.5,70,1,amc ambassador dpl

In [6]:
df4.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [7]:
df4.tail()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [8]:
df4.shape

(397, 9)

In [9]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     394 non-null    float64
 2   displacement  392 non-null    float64
 3   Horse Power   397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.0+ KB

In [10]:
df4.describe() # will execute only on int/float columns

,mpg,cylinders,displacement,weight,acceleration,year,origin
count,392.000000,394.000000,392.000000,397.000000,397.000000,397.000000,397.000000
mean,23.611735,5.439086,191.080357,2970.261965,15.555668,75.994962,1.574307
std,7.827466,1.693452,102.452019,847.904119,2.749995,3.690005,0.802549
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,100.750000,2223.000000,13.800000,73.000000,1.000000
50%,23.000000,4.000000,145.500000,2800.000000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,260.000000,3609.000000,17.100000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [11]:
df4['mpg']

0      18.0
1      15.0
2       NaN
3       NaN
4       NaN
       ...
392    27.0
393    44.0
394    32.0
395    28.0
396    31.0
Name: mpg, Length: 397, dtype: float64

In [12]:
# if you want to extract more than one column --> use second bracket
df4[['mpg','cylinders','acceleration']]

      mpg  cylinders  acceleration
0    18.0        8.0          12.0
1    15.0        8.0          11.5
2     NaN        8.0          11.0
3     NaN        8.0          12.0
4     NaN        8.0          10.5
..    ...        ...           ...
392  27.0        4.0          15.6
393  44.0        4.0          24.6
394  32.0        4.0          11.6
395  28.0        4.0          18.6
396  31.0        4.0          19.4

[397 rows x 3 columns]

In [13]:
%pwd

'C:\\Users\\Admin\\prathu'

In [14]:
######DATA Cleaning

In [15]:
#df4= pd.read_csv(r'C:\\Users\\Admin\\prathu') #r' is for reading strings
#df4

In [16]:
df4['mpg'].mean()

np.float64(23.611734693877548)

In [17]:
df4[['mpg', 'cylinders', 'acceleration']].min()

mpg             9.0
cylinders       3.0
acceleration    8.0
dtype: float64

In [18]:
#astype int<---> float type , convert to any string
#pd.to_numeric :object_>int

In [19]:
df4.head() # preveiw to dataset

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [20]:
df4['acceleration'].astype(int)

0      12
1      11
2      11
3      12
4      10
       ..
392    15
393    24
394    11
395    18
396    19
Name: acceleration, Length: 397, dtype: int64

In [21]:
#this is how convertion of string to int is done using astype() funtion

In [22]:
 # df4['Horse Power'].astype(int)

In [23]:
df4.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [24]:
# Removed problematic nested loop that created excessive output
# To add weights and acceleration: df4['weight'] + df4['acceleration']

In [29]:
df4['col1']= df4['acceleration'] + df4['weight']

In [30]:
df4.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3516.0
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3704.5
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,3447.0
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,3445.0
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,3459.5

In [31]:
df4['col2'] = df4['acceleration']**2

In [32]:
df4.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,144.00
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3704.5,132.25
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,3447.0,121.00
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,3445.0,144.00
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,3459.5,110.25

In [34]:
df4['col2'] = df4['acceleration'] +20 # in brackets if old name was given data will be replaced
df4.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3704.5,31.5
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,3447.0,31.0
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,3445.0,32.0
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,3459.5,30.5

In [35]:
int('20') # valid conversion

20

In [ ]:
#int('a') # this cannot be done

In [ ]:
import numpy as np
np.array([1,2,3,4,5,6])

array([1, 2, 3, 4, 5, 6])

In [ ]:
pd.to_numeric(df4['Horse Power'], errors='coerce')
#errors = coerce---> when encountered error skip them by converting them into blanks
#? --> null.blanks/empty

0      130.0
1      165.0
2      150.0
3      150.0
4      140.0
       ...
392     86.0
393     52.0
394     84.0
395     79.0
396     82.0
Name: Horse Power, Length: 397, dtype: float64

In [43]:
df4.isna().sum()

mpg             5
cylinders       3
displacement    5
Horse Power     0
weight          0
acceleration    0
year            0
origin          0
name            0
col1            0
col2            0
dtype: int64

In [44]:
df4['Horse Power']=pd.to_numeric(df4['Horse Power'], errors='coerce')
#errors = coerce---> when encountered error skip them by convererting them into blanks

In [45]:
df4.isna().sum() # after ci=onversion 5 '?' replaced  with null

mpg             5
cylinders       3
displacement    5
Horse Power     5
weight          0
acceleration    0
year            0
origin          0
name            0
col1            0
col2            0
dtype: int64

In [46]:
##handling null values

In [47]:
#1. Drop the rows where i have blanks
#2. replace null values with mean/medians/mode --->statistical values

In [49]:
df4.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5,31.5
2,NaN,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3447.0,31.0
3,NaN,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3445.0,32.0
4,NaN,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3459.5,30.5

In [50]:
df4.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5,31.5
2,NaN,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3447.0,31.0
3,NaN,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3445.0,32.0
4,NaN,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3459.5,30.5
5,NaN,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500,4351.0,30.0
6,NaN,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala,4363.0,29.0
7,14.0,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii,4320.5,28.5
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4435.0,30.0
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3858.5,28.5

In [51]:
df4.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5,31.5
2,NaN,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3447.0,31.0
3,NaN,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3445.0,32.0
4,NaN,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3459.5,30.5

In [54]:
df4.dropna() #changes are not saved in df4

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5,31.5
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4435.0,30.0
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3858.5,28.5
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,3573.0,30.0
...,...,...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86.0,2790,15.6,82,1,ford mustang gl,2805.6,35.6
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,2154.6,44.6
394,32.0,4.0,135.0,84.0,2295,11.6,82,1,dodge rampage,2306.6,31.6
395,28.0,4.0,120.0,79.0,2625,18.6,82,1,ford ranger,2643.6,38.6
396,31.0,4.0,119.0,82.0,2720,19.4,82,1,chevy s-10,2739.4,39.4

In [53]:
383/397

0.964735516372796

In [55]:
df4.shape

(397, 11)

In [56]:
df4=df4.dropna()

In [57]:
df4

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5,31.5
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4435.0,30.0
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3858.5,28.5
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,3573.0,30.0
...,...,...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86.0,2790,15.6,82,1,ford mustang gl,2805.6,35.6
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,2154.6,44.6
394,32.0,4.0,135.0,84.0,2295,11.6,82,1,dodge rampage,2306.6,31.6
395,28.0,4.0,120.0,79.0,2625,18.6,82,1,ford ranger,2643.6,38.6
396,31.0,4.0,119.0,82.0,2720,19.4,82,1,chevy s-10,2739.4,39.4

In [58]:
df4.shape

(383, 11)

In [59]:
df4=df4.dropna()

In [60]:
df4.dropna(inplace= True)

In [62]:
df4.shape

(383, 11)

In [63]:
df4.head(383)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5,31.5
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4435.0,30.0
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3858.5,28.5
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,3573.0,30.0
...,...,...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86.0,2790,15.6,82,1,ford mustang gl,2805.6,35.6
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,2154.6,44.6
394,32.0,4.0,135.0,84.0,2295,11.6,82,1,dodge rampage,2306.6,31.6
395,28.0,4.0,120.0,79.0,2625,18.6,82,1,ford ranger,2643.6,38.6
396,31.0,4.0,119.0,82.0,2720,19.4,82,1,chevy s-10,2739.4,39.4

In [64]:
df4.head(19)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5,31.5
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4435.0,30.0
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3858.5,28.5
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,3573.0,30.0
14,24.0,4.0,113.0,95.0,2372,15.0,70,3,toyota corona mark ii,2387.0,35.0
15,22.0,6.0,198.0,95.0,2833,15.5,70,1,plymouth duster,2848.5,35.5
16,18.0,6.0,199.0,97.0,2774,15.5,70,1,amc hornet,2789.5,35.5
17,21.0,6.0,200.0,85.0,2587,16.0,70,1,ford maverick,2603.0,36.0
18,27.0,4.0,97.0,88.0,2130,14.5,70,3,datsun pl510,2144.5,34.5
19,26.0,4.0,97.0,46.0,1835,20.5,70,2,volkswagen 1131 deluxe sedan,1855.5,40.5
20,25.0,4.0,110.0,87.0,2672,17.5,70,2,peugeot 504,2689.5,37.5
21,24.0,4.0,107.0,90.0,2430,14.5,70,2,audi 100 ls,2444.5,34.5
22,25.0,4.0,104.0,95.0,2375,17.5,70,2,saab 99e,2392.5,37.5
23,26.0,4.0,121.0,113.0,2234,12.5,70,2,bmw 2002,2246.5,32.5
24,21.0,6.0,199.0,90.0,2648,15.0,70,1,amc gremlin,2663.0,35.0
25,10.0,8.0,360.0,215.0,4615,14.0,70,1,ford f250,4629.0,34.0
26,10.0,8.0,307.0,200.0,4376,15.0,70,1,chevy c20,4391.0,35.0
27,11.0,8.0,318.0,210.0,4382,13.5,70,1,dodge d200,4395.5,33.5

In [65]:
df4.dropna()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0,32.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5,31.5
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4435.0,30.0
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3858.5,28.5
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,3573.0,30.0
...,...,...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86.0,2790,15.6,82,1,ford mustang gl,2805.6,35.6
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,2154.6,44.6
394,32.0,4.0,135.0,84.0,2295,11.6,82,1,dodge rampage,2306.6,31.6
395,28.0,4.0,120.0,79.0,2625,18.6,82,1,ford ranger,2643.6,38.6
396,31.0,4.0,119.0,82.0,2720,19.4,82,1,chevy s-10,2739.4,39.4

In [68]:
df4.drop('col2',axis = 1,inplace = True) # axis = 1 --> for columns # drop/delete col3 from df1
df4.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5

In [69]:
#data manipulation

In [70]:
df4.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3516.0
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3704.5
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4435.0
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3858.5
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,3573.0
14,24.0,4.0,113.0,95.0,2372,15.0,70,3,toyota corona mark ii,2387.0
15,22.0,6.0,198.0,95.0,2833,15.5,70,1,plymouth duster,2848.5
16,18.0,6.0,199.0,97.0,2774,15.5,70,1,amc hornet,2789.5
17,21.0,6.0,200.0,85.0,2587,16.0,70,1,ford maverick,2603.0
18,27.0,4.0,97.0,88.0,2130,14.5,70,3,datsun pl510,2144.5

In [72]:
df4.iloc[1:9 , 3:6]

    Horse Power  weight  acceleration
1         165.0    3693          11.5
8         225.0    4425          10.0
9         190.0    3850           8.5
10        170.0    3563          10.0
14         95.0    2372          15.0
15         95.0    2833          15.5
16         97.0    2774          15.5
17         85.0    2587          16.0

In [73]:
## loc
# we need to give names instead of index numbers
# End value is included/

In [78]:
df4.loc[1:8, 'Horse Power':'acceleration']

   Horse Power  weight  acceleration
1        165.0    3693          11.5
8        225.0    4425          10.0

In [79]:
### applying a function

In [81]:
def sqr_num(num):
    return num**2

In [83]:
df4['acceleration'].apply(sqr_num)

0      144.00
1      132.25
8      100.00
9       72.25
10     100.00
        ...
392    243.36
393    605.16
394    134.56
395    345.96
396    376.36
Name: acceleration, Length: 383, dtype: float64

In [89]:
def evn_odd(num):
    if num %2==0:
        return 'even'
    else:
        return 'odd'

In [91]:
df4['col1'] = df4['acceleration'].apply(evn_odd)
df4.head(3)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,even
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,odd
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,even

In [95]:
df4['col1'] =  df4['acceleration'].apply(lambda num: num**2)
df4['col2'] =  df4['acceleration'].apply(lambda num: 'Even' if num%2 ==0 else 'Odd')
df4.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,144.00,Even
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,132.25,Odd
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,100.00,Even
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,72.25,Odd
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,100.00,Even

In [98]:
df4.sort_values(by = 'mpg', ascending=False)
# ascending = True --> for ascending order

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,320.41,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,190.44,Odd
325,44.3,4.0,90.0,48.0,2085,21.7,80,2,vw rabbit c (diesel),470.89,Odd
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,605.16,Odd
326,43.4,4.0,90.0,48.0,2335,23.7,80,2,vw dasher (diesel),561.69,Odd
...,...,...,...,...,...,...,...,...,...,...,...
27,11.0,8.0,318.0,210.0,4382,13.5,70,1,dodge d200,182.25,Odd
67,11.0,8.0,429.0,208.0,4633,11.0,72,1,mercury marquis,121.00,Odd
25,10.0,8.0,360.0,215.0,4615,14.0,70,1,ford f250,196.00,Even
26,10.0,8.0,307.0,200.0,4376,15.0,70,1,chevy c20,225.00,Odd
28,9.0,8.0,304.0,193.0,4732,18.5,70,1,hi 1200d,342.25,Odd

In [99]:
# conditional formating
# extract records where mpg value is greater than 40

In [100]:
cond1 = df4['mpg'] > 40 # Relational operators ouput will always be boolean # <,>, <=, >= , ==, !=
cond1

0      False
1      False
8      False
9      False
10     False
       ...
392    False
393     True
394    False
395    False
396    False
Name: mpg, Length: 383, dtype: bool

In [101]:
df4[cond1]

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
244,43.1,4.0,90.0,48.0,1985,21.5,78,2,volkswagen rabbit custom diesel,462.25,Odd
309,41.5,4.0,98.0,76.0,2144,14.7,80,2,vw rabbit,216.09,Odd
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,368.64,Odd
325,44.3,4.0,90.0,48.0,2085,21.7,80,2,vw rabbit c (diesel),470.89,Odd
326,43.4,4.0,90.0,48.0,2335,23.7,80,2,vw dasher (diesel),561.69,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,190.44,Odd
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,605.16,Odd

In [104]:
cond2 = (df4['mpg'] > 40) & (df4['origin'] == 3)
cond2

0      False
1      False
8      False
9      False
10     False
       ...
392    False
393    False
394    False
395    False
396    False
Length: 383, dtype: bool

In [105]:
df4[cond2]

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,368.64,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,190.44,Odd

In [106]:
df4[(df4['mpg'] > 40) & (df4['origin'] == 3)] # reality

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,368.64,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,190.44,Odd